int BPM = 120;

int quarterNote;

int melody[][2] = {
  {ファ#,2},
  {ミ,2},

  {レ,2},
  {レ♭,2},

  {シ_,2},
  {ラ_,2},

  {シ_,2},
  {レ♭,2},

  {レ,2},
  {レ♭,2},

  {シ_,2},
  {ラ_,2},

  {ソ_,2},
  {ファ#_,2},

  {ソ_,2},
  {ラ_,2},

  {レ,4},
  {ファ#,4},
  {ラ,4},
  {ソ,4},

  {ファ#,4},
  {レ,4},
  {ファ,4},
  {ミ,4},

  {レ,4},
  {シ_,4},
  {レ,4},
  {ラ,4},

  {ソ,4},
  {シ,4},
  {ラ,4},
  {ソ,4},

  {ファ#,4},
  {レ,4},
  {ミ,4},
  {レ♭~,4},

  {レ~,4},
  {ファ#~,4},
  {ラ~,4},
  {ラ,4},

  {シ,4},
  {ソ,4},
  {ラ,4},
  {ファ#,4},

  {レ,4},
  {レ~,4},
  {レ~,4},
  {レ♭~,4},

  {レ~,4},
  {レ,4},
  {レ♭,4},
  {レ♭~,4},

  {シ,4},
  {シ_,4},
  {ラ_,4},
  {ラ,4},

  {ソ,4},
  {ソ~,4},
  {ファ#~,4},
  {ファ#,4},

  {ミ,4},
  {シ,4},
  {ミ,4},
  {ミ~,4}

  {ファ#~,1}
};

void setup() {

  Serial.begin(9600);

  quarterNote = 60000 / BPM;

  for(int i=0; i<3; i++) {

    int note = melody[i][0];
    int noteType = melody[i][1];

    int duration = (4.0 / noteType) * quarterNote;

    Serial.print(note);
    Serial.print(",");
    Serial.println(duration);

    delay(duration);
  }
}

void loop() {
}
