int BPM = 120;
int quarterNote;
int melody[][2] = {
  {1,  2},  //レ
  {4,  2},  // ラ
  {5,  2},  // シ
  {2,  2},  // ファ#
  {3,  2},  // ソ
  {0,  2},  // レ_
  {3,  2},  // ソ
  {4,  2},  // ラ

  {1,  2},  // レ
  {4,  2},  // ラ
  {5,  2},  // シ
  {2,  2},  // ファ#
  {3,  2},  // ソ
  {0,  2},  // レ_
  {3,  2},  // ソ
  {4,  2},  // ラ

  {1,  2},  // レ
  {4,  2},  // ラ
  {5,  2},  // シ
  {2,  2},  // ファ#
  {3,  2},  // ソ
  {0,  2},  // レ_
  {3,  2},  // ソ
  {4,  2},  // ラ

  {1,  2},  // レ
  {4,  2},  // ラ
  {5,  2},  // シ
  {2,  2},  // ファ#
  {3,  2},  // ソ
  {0,  2},  // レ_
  {3,  2},  // ソ
  {4,  2},  // ラ

  {1,  2},  // レ
  {4,  2},  // ラ
  {5,  2},  // シ
  {2,  2},  // ファ#
  {3,  2},  // ソ
  {0,  2},  // レ_
  {3,  2},  // ソ
  {4,  2},  // ラ
  
  {1,  2},  // レ
  {4,  2},  // ラ
  {5,  2},  // シ
  {2,  2},  // ファ#
  {3,  2},  // ソ
  {0,  2},  // レ_
  {3,  2},  // ソ
  {4,  2},  // ラ
};
void setup() {
  Serial.begin(9600);
  quarterNote = 60000 / BPM;
  for(int i=0; i<3; i++) {
    int note = melody[i][0];
    int noteType = melody[i][1];
    int duration = (4.0 / noteType) * quarterNote;
    Serial.print(note);
    Serial.print(",");
    Serial.println(duration);
    delay(duration);
  }
}
void loop() {
}